app/controllers/marketplaces_controller.rb

SELECT "marketplaces".* FROM "marketplaces"
---
  def index
    @marketplaces = Marketplace.all

INSERT INTO "marketplaces" ("patron_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["patron_id", 1], ["created_at", "2020-05-16 04:09:26.042456"], ["updated_at", "2020-05-16 04:09:26.042456"]]
INSERT INTO "marketplaces" ("patron_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["patron_id", 1], ["created_at", "2020-05-17 04:51:10.714925"], ["updated_at", "2020-05-17 04:51:10.714925"]]
---
  def create
    @marketplace = Marketplace.new()
    @marketplace.patron = current_patron
    @marketplace.image.attach(params[:marketplace][:image])
    respond_to do |format|
      if @marketplace.save

UPDATE "marketplaces" SET "updated_at" = $1 WHERE "marketplaces"."id" = $2  [["updated_at", "2020-05-17 04:51:10.851662"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @marketplace.update(marketplace_params)

SELECT "marketplaces".* FROM "marketplaces" WHERE "marketplaces"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def set_marketplace
    @marketplace = Marketplace.find(params[:id])