app/controllers/menu_items_controller.rb

INSERT INTO "menu_items" ("name", "price", "created_at", "updated_at", "marketplace_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "chicken"], ["price", "2.0"], ["created_at", "2020-05-19 04:56:20.632261"], ["updated_at", "2020-05-19 04:56:20.632261"], ["marketplace_id", 1]]
---
    def create
        @menu_item = MenuItem.new(menu_item_params)
        @menu_item.marketplace_id = current_patron.marketplace.id
        @menu_item.save