app/controllers/patrons_controller.rb

  def show
    @patron = Patron.find(params[:id])
---
SELECT "patrons".* FROM "patrons" WHERE "patrons"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def edit
     @patron = Patron.find(params[:id])
---
SELECT "patrons".* FROM "patrons" WHERE "patrons"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]